Revit 2027 API
ParameterTypeId.RebarSystemActiveFrontDirn1 Property
 "Exterior Major Direction"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemActiveFrontDirn1 { get; }
Public Shared ReadOnly Property RebarSystemActiveFrontDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemActiveFrontDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemActiveFrontDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace